Repository: minhtaama/money-tracker
Catalog: lib/src/localization/app_*.arb
Languages: vi

# quoteCreditCalendarDialog8_1
source: Oops! There is a spending between current date and selected date
vi: Oops! Có một khoản chi tiêu nằm giữa ngày hiện tại và ngày được chọn
