Repository: minhtaama/money-tracker
Catalog: lib/src/localization/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Dashboard
vi: Bảng tin

source: Settings
vi: Cài đặt

source: Accounts
vi: Tài khoản

source: Saving accounts
vi: Tài khoản tiết kiệm

source: Categories
vi: Danh mục

source: Budgets
vi: Ngân sách

# savings
source: Saving
vi: Khoản tiết kiệm

source: Recurrence
vi: Lặp lại

source: Report
vi: Báo cáo

source: Account
vi: Tài khoản

source: Credit account
vi: Tài khoản tín dụng

source: Regular account
vi: Tài khoản thường

source: Category
vi: Danh mục

source: Budget
vi: Ngân sách

source: Saving
vi: Khoản tiết kiệm

source: Initial balance
vi: Số dư ban đầu

source: Income
vi: Thu nhập

source: Transfer
vi: Chuyển khoản

source: Expense
vi: Chi tiêu

source: Credit spending
vi: Chi tiêu tín dụng

source: Credit payment
vi: Thanh toán tín dụng

source: Planned transactions
vi: Giao dịch theo kế hoạch

source: Total income
vi: Tổng thu nhập

source: Total expense
vi: Tổng chi tiêu

source: This month
vi: Tháng này

source: This week
vi: Tuần này

source: Previous month
vi: Tháng liền trước

source: Previous week
vi: Tuần liền trước

source: Same month last year
vi: Tháng cùng kỳ năm ngoái

source: Same week last month
vi: Tuần này tháng trước

# nTransactionsSelected
source: {count, plural, =0{no transaction} =1{1 transaction} other{{count} transactions}} selected
vi: đã chọn {count, plural, =0{0 giao dịch} =1{1 giao dịch} other{{count} giao dịch}}

source: Today
vi: Hôm nay

source: Daily
vi: Hàng ngày

source: Weekly
vi: Hàng tuần

source: Monthly
vi: Hàng tháng

source: Yearly
vi: Hàng năm

# nthWeek
source: {count, select, 0{0} 1{1st} 2{2nd} 3{3rd} other{{count}th}} week
vi: Tuần thứ {count, select, 0{0} 1{1} 2{2} 3{3} other{{count}}}

source: Invalid amount
vi: Dữ liệu không đúng

# goBack
source: No, go back
vi: Không, quay lại

source: Back
vi: Quay lại

source: Done
vi: Xong

source: Select
vi: Chọn

source: Delete
vi: Xoá

source: Add
vi: Thêm mới

# mon
source: M
vi: T2

# tue
source: T
vi: T3

# wed
source: W
vi: T4

# thu
source: T
vi: T5

# fri
source: F
vi: T6

# sat
source: S
vi: T7

# sun
source: S
vi: CN

source: Monday
vi: Thứ hai

source: Tuesday
vi: Thứ ba

source: Wednesday
vi: Thứ tư

source: Thursday
vi: Thứ năm

source: Friday
vi: Thứ sáu

source: Saturday
vi: Thứ bảy

source: Sunday
vi: Chủ nhật

# localeDefault
source: Default
vi: Mặc Định

source: Jan
vi: Th1

source: Feb
vi: Th2

source: Mar
vi: Th3

source: Apr
vi: Th4

source: May
vi: Th5

source: Jun
vi: Th6

source: Jul
vi: Th7

source: Aug
vi: Th8

source: Sep
vi: Th9

source: Oct
vi: Th10

source: Nov
vi: Th11

source: Dec
vi: Th12

source: January
vi: tháng 1

source: February
vi: tháng 2

source: March
vi: tháng 3

source: April
vi: tháng 4

# mayLong
source: May
vi: tháng 5

source: June
vi: tháng 6

source: July
vi: tháng 7

source: August
vi: tháng 8

source: September
vi: tháng 9

source: October
vi: tháng 10

source: November
vi: tháng 11

source: December
vi: tháng 12

# regularAdj
source: Regular
vi: Thường

# creditAdj
source: Credit
vi: Tín dụng

# savingAdj
source: Saving
vi: Tiết kiệm

source: Add account
vi: Thêm tài khoản

source: Deleted account
vi: Tài khoản đã xoá

# deleteAccountConfirm1
source: 1 more confirmation to delete this account
vi: Xác nhận lần nữa để xoá tài khoản

# deleteAccountConfirm2
source: Last warning. The account will be deleted after this confirmation.
vi: Cảnh báo lần cuối, tài khoản sẽ bị xoá sau lần xác nhận này.

source: Current balance:
vi: Số dư hiện tại:

source: Outstanding credit:
vi: Hạn mức còn lại:

source: No accounts available
vi: Không có tài khoản nào

source: No savings available
vi: Không có khoản tiết kiệm nào

# quoteRegularAccountScreen
source: This account does not have any transactions in {month}, Create a new one by tapping ''+'' button
vi: Tài khoản này không có giao dịch nào trong {month}, Thêm mới bằng cách ấn nút ''+''

source: Edit saving account
vi: Tuỳ chỉnh khoản tiết kiệm

# savingMustHigherThan0
source: Saving target must higher than 0
vi: Mục tiêu phải lớn hơn 0

source: Saving target
vi: Mục tiêu tiết kiệm

# editRegularAccount
source: Edit account
vi: Tuỳ chỉnh tài khoản

# areYouSureToDeleteRegularAccount1
source: Are you sure that you want to delete account "{accountName}"
vi: Bạn có chắc chắn muốn xoá tài khoản "{accountName}"?

# areYouSureToDeleteRegularAccount2
source: Transactions relate to this account will appear as of "deleted account".
vi: Các giao dịch liên quan tới tài khoản này sẽ hiển thị dưới dạng "Tài khoản đã xoá".

# noTransactionMadeBeforeThisDay
source: No transactions has made before this day
vi: Không có giao dịch nào trước ngày này

source: Tap to add balance checkpoint
vi: Ấn để thêm mới checkpoint

source: Edit credit account
vi: Tuỳ chỉnh tài khoản tín dụng

source: Credit limit
vi: Hạn mức tín dụng

source: Account APR
vi: APR

# paymentAndInterestPreferences
source: Payment & Interest preferences:
vi: Tuỳ chỉnh thanh toán & lãi suất:

source: Annual Percentage Rate
vi: Lãi suất thường niên

# usingADB
source: Using Average Daily Balance
vi: Sử dụng Average Daily Balance

# paymentOnlyGracePeriod
source: Payment only in grace period
vi: Chỉ thanh toán trong kỳ gia hạn

# paymentOnlyGracePeriodExplanation
source: Can not make payment in billing cycle, interest is calculated by other method.
vi: Không thể thanh toán trong cùng kỳ chi tiêu.

# areYouSureToDeleteCreditAccount1
source: Are you sure that you want to delete credit account "{accountName}"
vi: Bạn có chắc chắn muốn xoá tài khoản tín dụng "{accountName}"

# areYouSureToDeleteCreditAccount2
source: Are you sure? All transactions (except payments to this account) will be deleted, too.
vi: Bạn chắc chắn chứ? Toàn bộ giao dịch (trừ các giao dịch thanh toán tín dụng) cũng sẽ bị xoá.

# quoteCreditAccountComponent1
source: This statement has been closed
vi: Kỳ sao kê này đã kết thúc

# quoteCreditAccountComponent1_1
source: Unable to modify
vi: Không thể chỉnh sửa

# quoteCreditAccountComponent2
source: This statement has balance checkpoint
vi: Kỳ sao kê này có checkpoint

# quoteCreditAccountComponent2_1
source: Used to modify the total balance or to remove any on-going installments at statement date
vi: Dùng để chỉnh sửa dư nợ hiện tại hoặc kết thúc các giao dịch trả góp đang thực hiện tại ngày sao kê nhất định

# quoteCreditAccountComponent3
source: Because of carry-over balance, interest might be added in next statement even if pay-in-full
vi: Do có dư nợ từ kỳ trước, có thể vẫn sẽ bị tính lãi tại kỳ sau dù cho kỳ này có thanh toán đủ hay không.

# quoteCreditAccountComponent4
source: Pay-in-full before this day for interest-free
vi: Thanh toán đủ trước ngày này để được miễn lãi

source: Payment
vi: Thanh toán

source: Oustd. balance:
vi: Dư nợ còn lại:

source: Inst. left:
vi: Trả góp còn lại:

source: Payment required:
vi: Cần phải thanh toán:

source: Billing cycle start
vi: Kỳ chi tiêu bắt đầu

source: Previous due date
vi: Hạn thanh toán kỳ trước

# endOfLastGrace
source: End of last grace period
vi: Kết thúc kỳ gia hạn của kỳ trước

source: Statement date
vi: Ngày sao kê

source: Statement date with checkpoint
vi: Ngày sao kê có checkpoint

# beginOfGrace
source: Begin of grace period
vi: Bắt đầu kỳ gia hạn

source: Payment due date
vi: Hạn thanh toán

source: With adjustment checkpoint
vi: Cùng với checkpoint điều chỉnh

source: Carry
vi: Nợ kỳ trước

source: Interest
vi: Lãi suất

# quotePayment1
source: Because of carry-over balance, interest might be added in next statement even if pay-in-full
vi: Do có dư nợ từ kỳ trước, có thể vẫn sẽ bị tính lãi tại kỳ sau dù cho kỳ này có thanh toán đủ hay không.

# quotePayment2
source: Pay-in-full before this day for interest-free
vi: Thanh toán đủ trước ngày này để được miễn lãi

# quotePayment3
source: For easier tracking, you can only pay for transactions happens before selected day
vi: Để dễ theo dõi, bạn chỉ có thể thanh toán cho các giao dịch xảy ra trước ngày đang chọn

source: Balance to pay at selected day:
vi: Dư nợ cần thanh toán tại ngày đang chọn:

source: Estimated balance to pay at selected day:
vi: Khoảng dư nợ cần thanh toán tại ngày đang chọn:

# daysLeftUntilStatementDate
source: {count, plural, =0{Tomorrow is} =1{1 day left until} other{{count} days left until}} statement date
vi: {count, plural, =0{Mai là} =1{Còn 1 ngày cho đến} other{Còn {count} ngày cho đến}} ngày sao kê

# daysLeftUntilPaymentDueDate
source: {count, plural, =0{Tomorrow is} =1{1 day left until} other{{count} days left until}} payment due date
vi: {count, plural, =0{Mai là} =1{Còn 1 ngày cho đến} other{Còn {count} ngày cho đến}} hạn thanh toán

# dateOrdinal
source: Day {count, select, 0{0} 1{1st} 2{2nd} 3{3rd} other{{count}th}}
vi: Ngày {count}

source: of this month
vi: của tháng này

source: of next month
vi: của tháng sau

source: Add new budget
vi: Thêm mới ngân sách

source: Edit budget
vi: Chỉnh sửa ngân sách

source: Show budgets
vi: Hiện ngân sách

source: For categories
vi: Cho danh mục

source: For accounts
vi: Cho tài khoản

source: Please input name
vi: Hãy nhập tên

source: Budget name
vi: Tên ngân sách

source: Budget limit
vi: Hạn mức

# quoteBudget1
source: Select categories registered with budget:
vi: Lựa chọn danh mục gắn với ngân sách:

# quoteBudget2
source: Select accounts registered with budget:
vi: Lựa chọn tài khoản gắn với ngân sách:

source: No items
vi: Không có gì cả!

source: Assigned accounts
vi: Các tài khoản thuộc ngân sách

source: Assigned categories
vi: Các danh mục thuộc ngân sách

source: No budgets available
vi: Không có ngân sách nào có sẵn

source: Related budgets will be shown here
vi: Các ngân sách liên quan sẽ hiển thị tại đây

source: Tap to hide
vi: Ấn để ẩn

# areYouSureToDeleteBudget
source: Are you sure that you want to delete budget "{accountName}"?
vi: Bạn có chắc chắn muốn xoá ngân sách "{accountName}"?

source: Add new category
vi: Thêm mới danh mục

source: Category name
vi: Tên danh mục

# chooseCategoryFirst
source: Choose a category first
vi: Hãy chọn danh mục trước

# addNewCategoryTag
source: New category tag...
vi: Thêm tag danh mục...

source: Edit category
vi: Chỉnh sửa danh mục

source: Edit tag
vi: Chỉnh sửa tag

source: Already has same tag
vi: Đã có tag tương tự

source: No categories available
vi: Không có danh mục nào có sẵn

# areYouSureToDeleteCategory
source: Are you sure that you want to delete category "{accountName}"?
vi: Bạn có chắc chắn muốn xoá danh mục "{accountName}"?

# areYouSureToDeleteTag
source: Are you sure that you want to delete tag "{accountName}"?
vi: Bạn có chắc chắn muốn xoá tag "{accountName}"?

source: Edit Dashboard
vi: Chỉnh sửa bảng tin

# quoteDashboard1
source: Re-order and choose which widget to display
vi: Đổi vị trí hoặc chọn widget nào muốn hiển thị

source: Monthly expense
vi: Chi tiêu trong tháng

source: Monthly income
vi: Thu nhập trong tháng

source: No expense this month
vi: Không có chi tiêu nào tháng này

source: No income this month
vi: Không có thu nhập trong tháng này

source: Total
vi: Tổng

source: Upcoming
vi: Sắp tới

source: Payment for:
vi: Thanh toán cho:

source: Weekly Report
vi: Báo cáo tuần

source: Choose icon
vi: Lựa chọn icon

source: Choose account
vi: Lựa chọn tài khoản

source: Choose credit account first
vi: Hãy chọn tài khoản tín dụng trước

source: Choose category
vi: Lựa chọn danh mục

source: Choose tag
vi: Lựa chọn tag

source: Choose
vi: Chọn

source: No credit accounts
vi: Không có tài khoản tín dụng nào

source: No regular accounts
vi: Không có tài khoản nào

source: No income categories
vi: Không có danh mục thu nhập nào

source: No expense categories
vi: Không có danh mục chi tiêu nào

# tapHereToCreateFirstOne
source: Tap here to create the first one
vi: Ấn vào đây để tạo mới

source: On
vi: Bật

source: Off
vi: Tắt

source: System default
vi: Mặc định hệ thống

source: Theme color
vi: Màu sắc giao diện

source: Use dark mode
vi: Sử dụng chế độ ban đêm

source: Set Currency
vi: Cài đặt tiền tệ

source: Currency format
vi: Dạng hiển thị

source: With decimal digits
vi: Sử dụng hệ thập phân

source: Language
vi: Ngôn ngữ

source: Long date format
vi: Dạng ngày dài

source: Short date format
vi: Dạng ngày ngắn

source: First day of week
vi: Ngày đầu tiên trong tuần

source: Current assets
vi: Số dư hiện tại

# quoteHomepage
source: You don't have any transactions in {month}, Create a new one by tapping ''+'' button
vi: Không có giao dịch nào trong {month}, Tạo mới bằng cách ấn nút "+"

# cashflowIn
source: Cashflow in {month}
vi: Dòng tiền trong {month}

# expenseIn
source: Expense in {month}
vi: Chi tiêu trong {month}

# incomeIn
source: Income in {month}
vi: Thu nhập trong {month}

# assetsLeftIn
source: Assets left in {month}
vi: Số dư cuối trong {month}

# expectedAssetsIn
source: Expected assets in {month}
vi: Số dư dự tính trong {month}

source: Assets
vi: Tổng tài sản

source: Daily Report
vi: Báo cáo hàng ngày

source: Transactions
vi: Các giao dịch

source: Upcoming transactions
vi: Giao dịch sắp tới

source: Recurrence transactions
vi: Giao dịch lặp lại

source: Favorite transactions
vi: Giao dịch yêu thích

source: Installment payment
vi: Thanh toán trả góp

# quoteInstallmentPayment1
source: This transaction has been registered for installment payments, so you won\'t have to pay in this statement cycle; instead, you only need to settle the installment amount from next statement cycle.
vi: Giao dịch này đã được đăng ký trả góp. Không cần phải thanh toán toàn bộ số chi trong kỳ tiếp theo mà chỉ cần thanh toán một phần hàng tháng.

# installmentPaymentIn
source: Installment payment in {month} month(s)
vi: Trả góp trong {month} tháng

source: Pay before due date
vi: Thanh toán trước hạn cuối của kỳ sao kê

source: Adjustment amount
vi: Điều chỉnh

# quoteAdjustmentAmount
source: This payment is adjusted to align with the actual credit balance
vi: Khoản thanh toán này đã được điều chỉnh cho khớp với dư nợ tín dụng thực tế

source: Overdue
vi: Quá hạn

source: Skip
vi: Bỏ qua

source: Un-skip
vi: Huỷ bỏ qua

source: Skipped
vi: Đã bỏ qua

source: Added
vi: Đã thêm

source: Not specified
vi: Không xác định

source: Empty
vi: Trống

source: Optional
vi: Phụ lục

source: Hold to reorder
vi: Giữ để sắp xếp vị trí

source: Spending amount
vi: Khoản chi tiêu

source: Payment amount
vi: Khoản thanh toán

source: Amount
vi: Khoản tiền

source: Transfer to:
vi: Chuyển khoản tới:

source: Add saving to:
vi: Thêm tiết kiệm tới:

source: Transfer saving to:
vi: Chuyển tiết kiệm đến:

source: Payment from:
vi: Thanh toán từ:

source: Payment to:
vi: Thanh toán cho:

source: Checkpoint at:
vi: Checkpoint tại:

source: Credit account to pay:
vi: Thanh toán cho TK tín dụng:

source: Bal. after payment:
vi: Dư nợ sau thanh toán:

source: Installment period:
vi: Kỳ trả góp:

source: On-going installments:
vi: Giao dịch trả góp đang có:

source: Total unpaid installment balance:
vi: Số trả góp còn lại:

source: month(s) left
vi: tháng nữa

source: Expense category:
vi: Danh mục chi tiêu:

source: Add adjustment
vi: Thêm điều chỉnh

# addCreditPayment
source: Add payment
vi: Thêm thanh toán

# addCreditSpending
source: Add spending
vi: Thêm chi tiêu

source: Add income
vi: Thêm thu nhập

source: Add expense
vi: Thêm chi tiêu

source: Add transfer
vi: Chuyển khoản

source: For credit account
vi: Cho tài khoản tín dụng

source: For regular account
vi: Cho tài khoản thường

source: Between regular account
vi: Giữa các tài khoản thường

source: To saving account
vi: Đến tài khoản tiết kiệm

source: Out of saving account
vi: Ra khỏi tài khoản tiết kiệm

source: Full payment
vi: Thanh toán đủ

source: Start payment in next statement
vi: Bắt đầu thanh toán từ kỳ sao kê sau

source: For your knowledge
vi: Lưu ý

# quoteTransaction1
source: Add [transactions has installment payment going through this checkpoint] first, if any.
vi: Thêm mới [Các giao dịch chi tiêu có đăng ký trả góp] trước khi thêm checkpoint.

# quoteTransaction2
source: Must higher than unpaid installments amount
vi: Phải lớn hơn khoản trả góp còn lại

source: No transactions
vi: Không có giao dịch nào

source: No planned transactions this month
vi: Không có giao dịch kế hoạch nào trong tháng

# noOngoingInstallments
source: No ongoing installments at selected date
vi: Không có khoản trả góp đang hoạt động nào tại ngày đang chọn

# deleteTransactionConfirm1
source: Delete this transaction?
vi: Xoá giao dịch này?

# deleteTransactionConfirm2
source: All related transactions will be deleted, too.
vi: Toàn bộ giao dịch có liên quan cũng sẽ bị xoá.

# deleteTransactionConfirm3
source: Delete this favorite transaction?
vi: Xoá giao dịch yêu thích này?

# deleteTransactionAlert1
source: Some of your credit transaction can not be deleted
vi: Một số giao dịch tín dụng không thể xoá được.

# deleteTransactionAlertQuote1
source: The credit spending transaction can only be deleted if all payment after the transaction is selected to delete too. The credit payment transaction can only be deleted if all payment is selected from the latest payment or after the latest closed statement
vi: Giao dịch chi tiêu tín dụng chỉ có thể bị xoá khi toàn bộ giao dịch thanh toán tín dụng sau nó cũng được chọn để xoá. Giao dịch thanh toán tín dụng chỉ có thể bị xoá khi toàn bộ giao dịch thanh toán sau nó cũng được chọn hoặc đang trong kỳ sao kê mới nhất chưa chốt.

# deleteNTransactionConfirm
source: Are you sure to delete {count, plural, =0{no transaction} =1{1 transaction} other{{count} transactions}}?
vi: Xoá {count, plural, =0{0 giao dịch} =1{1 giao dịch} other{toàn bộ {count} giao dịch}} này?

# quoteTransaction3
source: Too high than balance to pay!
vi: Quá cao so với dư nợ cần thanh toán!

# quoteTransaction3_1
source: Maybe there are other spending transactions before this day? If not a full payment, you must specify the balance after payment amount
vi: Có thể bạn còn các giao dịch chi tiêu trước ngày này chưa nhập? Nếu không phải là khoản thanh toán đủ, bạn cần phải nhập dư nợ còn lại sau thanh toán

# quoteTransaction4
source: Pay amount is quite higher
vi: Hơi cao so với dư nợ cần thanh toán

# quoteTransaction4_1
source: Are there some hidden fee or some small transaction you forgot to add? If not a full payment, you must specify the balance after payment amount
vi: Có thể bạn còn các giao dịch chi tiêu trước ngày này chưa nhập? Nếu không phải là khoản thanh toán đủ, bạn cần phải nhập dư nợ còn lại sau thanh toán

# quoteTransaction5
source: Close to balance to pay!
vi: Gần bằng với dư nợ cần thanh toán!

# quoteTransaction5_1
source: Is this a full payment? If so, please tick "Full Payment" below!
vi: Đây có phải là khoản thanh toán đủ không? Nếu đúng, hãy tick vào "Thanh toán đủ" phía dưới.

# quoteTransaction6
source: Exact balance to pay!
vi: Khớp với dư nợ cần thanh toán!

# quoteTransaction7
source: No balance left to pay
vi: Không có dư nợ cần thanh toán

# quoteTransaction8
source: All fees must be included
vi: Phải bao gồm toàn bộ các chi phí

# quoteTransaction9
source: Can not delete because there are payment(s) after this transaction
vi: Không thể xoá vì đang có giao dịch thanh toán tín dụng xảy ra sau giao dịch này

# quoteTransaction10
source: Can not delete payment in the period has been recorded on the statement.
vi: Không thể xoá giao dịch thanh toán trong kỳ sao kê đã kết thúc.

# quoteTransaction11
source: Oops! Can not transfer in same account!
vi: Oops! Không thể chuyển tiền trong cùng tài khoản!

source: Please select a date
vi: Hãy chọn ngày

# pleaseTickFullPayment
source: Please tick as full payment
vi: Hãy tick vào thanh toán đủ

source: Please specify an amount
vi: Hãy nhập một con số

# mustSpecifyCreditAccount
source: Must specify a credit account
vi: Phải nhập tài khoản tín dụng

# mustSpecifyRegularAccount
source: Must specify an account
vi: Phải nhập tài khoản

# mustSpecifyDestinationAccount
source: Must specify a destination account
vi: Phải nhập tài khoản đích

# mustSpecifyForPayment
source: Must be specify for payment
vi: Phải nhập tài khoản thanh toán

# mustSpecifyCategory
source: Must specify a category
vi: Phải nhập danh mục

# noStatementFound
source: No statement found in selected day
vi: Không tìm thấy kỳ sao kê nào gắn với ngày đang chọn

source: Higher than balance to pay
vi: Cao hơn dư nợ cần thanh toán

source: Too high
vi: Quá cao

source: day(s)
vi: ngày

source: week(s)
vi: tuần

source: month(s)
vi: tháng

source: year(s)
vi: năm

source: Forever
vi: Mãi mãi

source: Select repeat condition
vi: Lựa chọn điều kiện lặp

# wrongInterval
source: Wrong interval format
vi: Sai khoảng thời gian

source: Do not repeat
vi: Không lặp

source: Repeat every
vi: Lặp lại mỗi

# everyNDay
source: {count, plural, =0{no day} =1{every day} other{every {count} days}}
vi: {count, plural, =0{không ngày nào} =1{mọi ngày} other{mỗi {count} ngày}}

# everyNWeek
source: {count, plural, =0{no week} =1{every week} other{every {count} weeks}}
vi: {count, plural, =0{không tuần nào} =1{mỗi tuần} other{mỗi {count} tuần}}

# everyNMonth
source: {count, plural, =0{no month} =1{every month} other{every {count} months}}
vi: {count, plural, =0{không tháng nào} =1{mỗi tháng} other{mỗi {count} tháng}}

# everyNYear
source: {count, plural, =0{no year} =1{every year} other{every {count} years}}
vi: {count, plural, =0{không năm nào} =1{mỗi năm} other{mỗi {count} năm}}

# repeatPattern
source: {kind, select, xWeek{on} xMonth{on the} xYear{on} other{}} {pattern}
vi: {kind, select, xWeek{vào} xMonth{vào} xYear{vào} other{}} {pattern}

source: until {endDate}
vi: cho đến {endDate}

# quoteRecurrence1
source: This transaction doesn't repeat
vi: Giao dịch này không lặp lại

# quoteRecurrence2
source: This transaction will start{isTodayStartDate, select, true{} other{ on}} {startDate} and repeat {everyN} {repeatPattern} {endDate}
vi: Giao dịch này sẽ bắt đầu{isTodayStartDate, select, true{ ngay} other{ từ}} {startDate} và lặp lại {everyN} {repeatPattern} {endDate}

# quoteRecurrence3
source: This transaction started{isTodayStartDate, select, true{} other{ on}} {startDate} and repeat {everyN} {repeatPattern} {endDate}
vi: Giao dịch này bắt đầu{isTodayStartDate, select, true{ ngay} other{ từ}} {startDate} và lặp lại {everyN} {repeatPattern} {endDate}

source: Clear date
vi: Xoá ngày

# quoteCreditCalendarDialog1
source: This credit account currently has no credit/BNPL transaction needed to pay
vi: Tài khoản tín dụng này hiện không có giao dịch nào cần thanh toán

# quoteCreditCalendarDialog2
source: No transactions before this time
vi: Không có giao dịch nào trước ngày này

# quoteCreditCalendarDialog3
source: Select a payment day. Spending transaction can be paid will be displayed here
vi: Chọn ngày thanh toán. Các giao dịch cần thanh toán sẽ hiển thị tại đây

# quoteCreditCalendarDialog4
source: You can only add transaction after [latest checkpoint]
vi: Bạn chỉ có thể thêm giao dịch sau [ngày checkpoint cuối cùng]

# quoteCreditCalendarDialog4_1
source: You can only select day after [latest checkpoint]
vi: Bạn chỉ có thể chọn ngày sau [ngày checkpoint cuối cùng]

# quoteCreditCalendarDialog5
source: Oops! You can only add transactions since [the statement contains the latest payment]
vi: Oops! Bạn chỉ có thể them giao dịch kể từ [kỳ sao kê chứa khoản thanh toán cuối cùng]

# quoteCreditCalendarDialog5_1
source: Oops! You can only select day in this statement
vi: Oops! Bạn chỉ có thể chọn ngày trong kỳ sao kê này

# quoteCreditCalendarDialog6
source: Oops! This is future statement!
vi: Oops! Đây là kỳ sao kê trong tương lai!

# quoteCreditCalendarDialog7
source: Oops! Can only pay in grace period (Account preference)
vi: Oops! Chỉ có thể thanh toán trong kỳ gia hạn (Cài đặt của tài khoản)

# quoteCreditCalendarDialog8
source: Oops! There is a payment between current date and selected date
vi: Oops! Có một khoản thanh toán nằm giữa ngày hiện tại và ngày được chọn
